<a href="https://colab.research.google.com/github/Jungsan005/R_statstics/blob/master/%EB%8D%B0%EC%9D%B4%ED%84%B0%ED%94%84%EB%A0%88%EC%9E%84_%EB%8B%A4%EB%A3%A8%EA%B8%B0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# 매니저 평점 분석
Manager <- c("1","2","3","4","5")
Date <- c("2014-10-24", "2014-10-28", "2014-10-01", "2014-10/12","2014-05-01")
Country <- c("US","US", "UK",  "UK", "UK")
Gender <- c("M","F","F","M","F")
Age <- c(32,45,25,39,99)
q1 <- c(5,3,3,3,2)
q2 <- c(4,5,5,3,2)
q3 <- c(5,2,5,4,1)
q4 <- c(5,5,5,NA,2)
q5 <- c(5,5,2,NA,1)


managers <- data.frame(Manager,Date, Country, Gender, Age, q1, q2, q3, q4, q5)

In [ ]:
managers

  Manager Date       Country Gender Age q1 q2 q3 q4 q5 ages
1 1       2014-10-24 US      M      32  5  4  5   5  5 중년
2 2       2014-10-28 US      F      45  3  5  2   5  5 중년
3 3       2014-10-01 UK      F      25  3  5  5   5  2 청년
4 4       2014-10/12 UK      M      39  3  3  4  NA NA 중년
5 5       2014-05-01 UK      F      99  2  2  1   2  1 노년

In [ ]:
# 나이라는 컬럼을 기준으로 age3s라는 새로운 컬러 생성

# age: 연속형 => ages: 범주형
# 나이 20 ~ 30: 청년
# 나이 31 ~ 45: 중년
# 나이 46 ~ 65: 장년
# 나이 66 ~   : 노년

# managers$새로운 컬럼 명 <- 값
# 데이터프레임에 존재하지 않는 컴럼을 명시하면 그 이름으로 새롭게 추가됨

managers$ages <- c(0,0,0,0,0) # 나이대 컬럼

# 데이터프레임 요소 접근하기
# 2차원배영릐 일종이므로 배열요소 접근방식 사용
# 데이터프레임[행, 열]

managers[1,1] # 매니저 번호 중 1번 출력
managers[1,'Country'] # 1번 매니저 국적
managers[1,c('Country','Gender')] 
managers[1,c(3,4)] 
managers[c(2,4), c(3,4)]
managers[3,1:10]
managers[3,]
managers[,5]

[1] 1
Levels: 1 2 3 4 5

[1] US
Levels: UK US

  Country Gender
1 US      M

  Country Gender
1 US      M

  Country Gender
2 US      F
4 UK      M

  Manager Date       Country Gender Age q1 q2 q3 q4 q5
3 3       2014-10-01 UK      F      25  3  5  5  5  2

  Manager Date       Country Gender Age q1 q2 q3 q4 q5 ages
3 3       2014-10-01 UK      F      25  3  5  5  5  2  0

[1] 32 45 25 39 99

In [ ]:
# 불리언(boolean) 인덱싱
# 특정 조건을 만족하는 데이터를 찾을 수 있음
# 데이터프레임[조건식]

managers$Gender == "M"

managers[managers$Gender=="M",]

[1]  TRUE FALSE FALSE  TRUE FALSE

  Manager Date       Country Gender Age q1 q2 q3 q4 q5
1 1       2014-10-24 US      M      32  5  4  5   5  5
4 4       2014-10/12 UK      M      39  3  3  4  NA NA

In [ ]:
managers[managers$Age > 40,]

  Manager Date       Country Gender Age q1 q2 q3 q4 q5
2 2       2014-10-28 US      F      45  3  5  2  5  5
5 5       2014-05-01 UK      F      99  2  2  1  2  1

In [ ]:
managers[managers$Age < 30 & managers$Gender == 'F', 'Country']

[1] UK
Levels: UK US

In [ ]:
cnd <- managers$Age < 30 & managers$Gender == 'F'
managers[cnd, 'Country']

[1] UK
Levels: UK US

In [ ]:
# 청년
cnd <- managers$Age > 20 & managers$Age <= 30
managers$ages[cnd] <- '청년'

In [ ]:
# 중년
cnd <- managers$Age > 31 & managers$Age <= 45
managers$ages[cnd] <- '중년'

In [ ]:
# 장년
cnd <- managers$Age > 46 & managers$Age <= 65
managers$ages[cnd] <- '장년'

In [ ]:
# 노년
cnd <- managers$Age > 66
managers$ages[cnd] <- '노년'

In [ ]:
managers

  Manager Date       Country Gender Age q1 q2 q3 q4 q5 ages
1 1       2014-10-24 US      M      32  5  4  5   5  5 중년
2 2       2014-10-28 US      F      45  3  5  2   5  5 중년
3 3       2014-10-01 UK      F      25  3  5  5   5  2 청년
4 4       2014-10/12 UK      M      39  3  3  4  NA NA 중년
5 5       2014-05-01 UK      F      99  2  2  1   2  1 노년b

In [ ]:
# 조건식이 둘 이상인 경우 쓸데없이 코드가 길어지고
# 가독성도 떨어짐 -> attach, with, within

In [ ]:
with(managers, ages[Age > 66] <- '노년a')
# 특정컬럼 수정 불가
managers

  Manager Date       Country Gender Age q1 q2 q3 q4 q5 ages
1 1       2014-10-24 US      M      32  5  4  5   5  5 중년
2 2       2014-10-28 US      F      45  3  5  2   5  5 중년
3 3       2014-10-01 UK      F      25  3  5  5   5  2 청년
4 4       2014-10/12 UK      M      39  3  3  4  NA NA 중년
5 5       2014-05-01 UK      F      99  2  2  1   2  1 노년

In [ ]:
managers <- within(managers, ages[Age > 66] <- '노년b')
managers
# 수정결과를 반영하려면 within 함수 결과를 
# 데이터프레임 변수에 저장해야 함

  Manager Date       Country Gender Age q1 q2 q3 q4 q5 ages
1 1       2014-10-24 US      M      32  5  4  5   5  5 중년
2 2       2014-10-28 US      F      45  3  5  2   5  5 중년
3 3       2014-10-01 UK      F      25  3  5  5   5  2 청년
4 4       2014-10/12 UK      M      39  3  3  4  NA NA 중년
5 5       2014-05-01 UK      F      99  2  2  1   2  1 노년b

In [ ]:
# within 함수를 이용해서 ages2컬럼에 
# 나이별 범주값 저장하는 코드 재작성
managers$ages2 <- c(0,0,0,0,0) # 나이대 컬럼

In [ ]:
within(managers,{
       ages2[Age <= 30] <- '청년b'
       ages2[Age >= 31] <- '중년b'
       ages2[Age >= 46] <- '장년b'
       ages2[Age >= 66] <- '노년b'
})

  Manager Date       Country Gender Age q1 q2 q3 q4 q5 ages  ages2
1 1       2014-10-24 US      M      32  5  4  5   5  5 중년  중년b
2 2       2014-10-28 US      F      45  3  5  2   5  5 중년  중년b
3 3       2014-10-01 UK      F      25  3  5  5   5  2 청년  청년b
4 4       2014-10/12 UK      M      39  3  3  4  NA NA 중년  중년b
5 5       2014-05-01 UK      F      99  2  2  1   2  1 노년b 노년b

In [ ]:
managers <- within(managers,{
       ages2[Age > 20 & Age <= 30] <- '청년a'
       ages2[Age > 31 & Age <= 45] <- '중년a'
       ages2[Age > 46 & Age <= 65] <- '장년a'
       ages2[Age > 66] <- '노년a'
})

In [ ]:
managers

  Manager Date       Country Gender Age q1 q2 q3 q4 q5 ages  ages2
1 1       2014-10-24 US      M      32  5  4  5   5  5 중년  중년a
2 2       2014-10-28 US      F      45  3  5  2   5  5 중년  중년a
3 3       2014-10-01 UK      F      25  3  5  5   5  2 청년  청년a
4 4       2014-10/12 UK      M      39  3  3  4  NA NA 중년  중년a
5 5       2014-05-01 UK      F      99  2  2  1   2  1 노년b 노년a

In [ ]:
# 설문문항 컬럼의 총합과 평균을 구해서
# sumq, meanq라는 컬럼 생성
# 단, NA는 0으로 대체함!
managers[4,9] <- 0
managers[4,10] <- 0

In [ ]:
managers$sumq <- c(0,0,0,0,0) # 총합
managers$meanq <- c(0,0,0,0,0) # 평균

In [ ]:
managers

  Manager Date       Country Gender Age q1 q2 q3 q4 q5 ages  ages2 sumq meanq
1 1       2014-10-24 US      M      32  5  4  5   5  5 중년  중년a 0    0
2 2       2014-10-28 US      F      45  3  5  2   5  5 중년  중년a 0    0
3 3       2014-10-01 UK      F      25  3  5  5   5  2 청년  청년a 0    0
4 4       2014-10/12 UK      M      39  3  3  4  NA NA 중년  중년a 0    0
5 5       2014-05-01 UK      F      99  2  2  1   2  1 노년b 노년a 0    0

In [ ]:
managers$sumq <- managers$q1+managers$q2+managers$q3+managers$q4+managers$q5

In [ ]:
managers$meanq <- managers$sumq /5

In [ ]:
managers <- within(managers,{
       sumq <- q1+q2+q3+q4+q5
       meanq <- sumq/5
})
managers

  Manager Date       Country Gender Age q1 q2 q3 q4 q5 ages  ages2 sumq meanq
1 1       2014-10-24 US      M      32  5  4  5  5  5  중년  중년a 24   4.8
2 2       2014-10-28 US      F      45  3  5  2  5  5  중년  중년a 20   4.0
3 3       2014-10-01 UK      F      25  3  5  5  5  2  청년  청년a 20   4.0
4 4       2014-10/12 UK      M      39  3  3  4  0  0  중년  중년a 10   2.0
5 5       2014-05-01 UK      F      99  2  2  1  2  1  노년b 노년a  8   1.6

In [ ]:
# 자주 사용하는 데이터프레임 저장하기
# save(객체명, 파일명)
# load(파일명)
# 단, 확장자는 rdata로 사용함

# 메모리내에 생성된 객체를 
# 외부파일 형태로 저장하고 싶다면
write.csv, write.table
wirie.csv, fwrite 함수를 사용함

In [ ]:
# R내장 데이터 중 iris 데이터셋을
# iris.csv로 저장해 봄
iris

In [ ]:
write.csv(x=iris, file='iris.csv', quote=F, row.names=F)
# row.names=F  행번호
# quote=F인용부호

In [108]:
# 지금까지 작업했던 managers데이터를 
# managers.csv로 저장해 봄
write.csv(x=managers, file='managers.csv', quote=F, row.names=F)

In [ ]:
# 외부 파일을 읽어와 작업하려면
read.csv, read.table,
read_csv, fread 함수를 사용하면 됨

In [ ]:
# 결측치(missing value) 처리하기
# 데이터 수집과정에서 채워지지 못한 값을 의미
# 데이터에 결측치가 포함되어 있으면
# 데이터 분석시 평향/왜곡된 결과가 도출될 수 있음
# 해결책: 제거하거나 추정값으로 대체

In [109]:
x <-  c(1,2,3,NA,5,NA,7)

In [112]:
sum(x) # 결측치 때문에 연산 불가

[1] NA

In [115]:
is.na(x) # 결측치 여부 확인
sum(is.na(x))
table(is.na(x))

[1] FALSE FALSE FALSE  TRUE FALSE  TRUE FALSE

[1] 2

FALSE  TRUE
    5     2

In [116]:
sum(x, na.rm = T) # sum함수 적용 시 NA는 제외함

[1] 18

In [119]:
x2 <- na.omit(x) # NA요소는 제거하고 출력

In [120]:
sum(x2)

[1] 18

In [123]:
# 결측치 확인 후, 다른 값(평균)으로 대체
y <-  c(10,9,NA,7,NA,NA,4)

In [126]:
mean <- mean(y, na.rm = T)

In [127]:
y[is.na(y)] <- mean

In [128]:
y

[1] 10.0  9.0  7.5  7.0  7.5  7.5  4.0

In [146]:
# 사원정보파일을 데이터프레임으로 읽어와서 결측치를 처리하세요
emp <- read.csv('https://raw.githubusercontent.com/Jungsan005/R_statstics/master/datasets/EMPLOYEES.csv')

In [147]:
head(emp, 10)

   EMPLOYEE_ID FIRST_NAME LAST_NAME EMAIL    PHONE_NUMBER HIRE_DATE  JOB_ID
1  100         Steven     King      SKING    515.123.4567 2003-06-17 AD_PRES
2  101         Neena      Kochhar   NKOCHHAR 515.123.4568 2005-09-21 AD_VP
3  102         Lex        De Haan   LDEHAAN  515.123.4569 2001-01-13 AD_VP
4  103         Alexander  Hunold    AHUNOLD  590.423.4567 2006-01-03 IT_PROG
5  104         Bruce      Ernst     BERNST   590.423.4568 2007-05-21 IT_PROG
6  105         David      Austin    DAUSTIN  590.423.4569 2005-06-25 IT_PROG
7  106         Valli      Pataballa VPATABAL 590.423.4560 2006-02-05 IT_PROG
8  107         Diana      Lorentz   DLORENTZ 590.423.5567 2007-02-07 IT_PROG
9  108         Nancy      Greenberg NGREENBE 515.124.4569 2002-08-17 FI_MGR
10 109         Daniel     Faviet    DFAVIET  515.124.4169 2002-08-16 FI_ACCOUNT
   SALARY COMMISSION_PCT MANAGER_ID DEPARTMENT_ID
1  24000  NA              NA         90
2  17000  NA             100         90
3  17000  NA             100         90
4   9000  NA             102         60
5   6000  NA             103         60
6   4800  NA             103         60
7   4800  NA             103         60
8   4200  NA             103         60
9  12008  NA             101        100
10  9000  NA             108        100

In [159]:
colSums(is.na(emp)) # 컬럼별 NA 수 확인

   EMPLOYEE_ID     FIRST_NAME      LAST_NAME          EMAIL   PHONE_NUMBER
             0              0              0              0              0
     HIRE_DATE         JOB_ID         SALARY COMMISSION_PCT     MANAGER_ID
             0              0              0             72              1
 DEPARTMENT_ID
             1

In [161]:
# 수당컬럼을 대상으로 NA를 0으로 변경
cnd <- is.na(emp$COMMISSION_PCT)
emp$COMMISSION_PCT[cnd] <- 0

In [162]:
colSums(is.na(emp))

   EMPLOYEE_ID     FIRST_NAME      LAST_NAME          EMAIL   PHONE_NUMBER
             0              0              0              0              0
     HIRE_DATE         JOB_ID         SALARY COMMISSION_PCT     MANAGER_ID
             0              0              0              0              1
 DEPARTMENT_ID
             1

In [164]:
# 우편번호파일을 데이터프레임으로 읽어와서 결측치를 처리하세요.(zip2013)
# 코렙을 통해 데이터파일을 읽어오는 경우, 
# 파일의 인코딩은 반드시 UTF-8로 설정할 것!
# 되도록이면 UTF-8로 설정하는 것이 좋음!!

zip2013 <- read.csv('zipcode_20130201(2).txt', sep='\t', na.strings = '', stringsAsFactors = F)
# sep : 컬럼을 구분할 구분자 정의 (기본: , )
# na.strings : NA로 지정할 문자열 정의
# => 빈 문자열은 NA로 자동 입력

In [167]:
colSums(is.na(zip2013))

ZIPCODE    SIDO   GUGUN    DONG      RI   BUNJI     SEQ
      0       0     186       0   20489   31541       0

In [171]:
cnd <- is.na(zip2013$GUGUN)
zip2013$GUGUN <- ''

In [172]:
colSums(is.na(zip2013))

ZIPCODE    SIDO   GUGUN    DONG      RI   BUNJI     SEQ
      0       0       0       0   20489       0       0

In [173]:
cnd <- is.na(zip2013$RI)
zip2013$RI <- ''

In [174]:
colSums(is.na(zip2013))

ZIPCODE    SIDO   GUGUN    DONG      RI   BUNJI     SEQ
      0       0       0       0       0       0       0

In [169]:
# NA로 작성된 주소컬럼들의 값을 빈 문자열로 대체함
zip2013$BUNJI <- ifelse(is.na(zip2013$BUNJI), '', zip2013$BUNJI)

In [170]:
colSums(is.na(zip2013))

ZIPCODE    SIDO   GUGUN    DONG      RI   BUNJI     SEQ
      0       0     186       0   20489       0       0

In [154]:
zip2013_0 <- read.csv('https://raw.githubusercontent.com/Jungsan005/R_statstics/master/datasets/zipcode_20130201(2).txt', sep='\t')

In [155]:
zip2013_0

      ZIPCODE SIDO GUGUN  DONG    RI            BUNJI       SEQ
1     135-806 서울 강남구 개포1동 경남아파트                 1
2     135-807 서울 강남구 개포1동 우성3차아파트 (1∼6동)      2
3     135-806 서울 강남구 개포1동 우성9차아파트 (901∼902동)  3
4     135-770 서울 강남구 개포1동 주공아파트    (1∼16동)     4
5     135-805 서울 강남구 개포1동 주공아파트    (17∼40동)    5
6     135-966 서울 강남구 개포1동 주공아파트    (41∼85동)    6
7     135-807 서울 강남구 개포1동 주공아파트    (86∼103동)   7
8     135-805 서울 강남구 개포1동 주공아파트    (104∼125동)  8
9     135-807 서울 강남구 개포1동 현대1차아파트 (101∼106동)  9
10    135-805 서울 강남구 개포1동               565         10
11    135-806 서울 강남구 개포1동               649∼651     11
12    135-807 서울 강남구 개포1동               652∼653     12
13    135-810 서울 강남구 개포1동               660         13
14    135-241 서울 강남구 개포1동                           14
15    135-800 서울 강남구 개포2동 우성8차아파트 (801∼803동) 15
16    135-771 서울 강남구 개포2동 주공아파트    (201∼232동) 16
17    135-800 서울 강남구 개포2동 주공아파트    (301∼325동) 17
18    135-772 서울 강남구 개포2동 주공아파트    (401∼415동) 18
19    135-800 서울 강남구 개포2동 주공아파트    (416∼458동) 19
20    135-992 서울 강남구 개포2동 주공아파트    (501∼506동) 20
21    135-993 서울 강남구 개포2동 주공아파트    (601∼609동) 21
22    135-993 서울 강남구 개포2동 주공아파트    (701∼708동) 22
23    135-800 서울 강남구 개포2동 현대3차아파트 (1∼5동)     23
24    135-800 서울 강남구 개포2동               94∼108      24
25    135-801 서울 강남구 개포2동               138         25
26    135-802 서울 강남구 개포2동               139∼140     26
27    135-800 서울 강남구 개포2동               152∼156     27
28    135-802 서울 강남구 개포2동               157∼169     28
29    135-800 서울 강남구 개포2동               170∼177     29
30    135-803 서울 강남구 개포2동               178         30
⋮     ⋮       ⋮    ⋮      ⋮       ⋮             ⋮           ⋮
52115 363-911 충북 청원군 옥산면  국사리                    52115
52116 363-912 충북 청원군 옥산면  금계리                    52116
52117 363-911 충북 청원군 옥산면  남촌리                    52117
52118 363-913 충북 청원군 옥산면  덕촌리                    52118
52119 363-912 충북 청원군 옥산면  동림리                    52119
52120 363-912 충북 청원군 옥산면  사정리                    52120
52121 363-911 충북 청원군 옥산면  소로리                    52121
52122 363-912 충북 청원군 옥산면  수락리                    52122
52123 363-913 충북 청원군 옥산면  신촌리                    52123
52124 363-914 충북 청원군 옥산면  오산리                    52124
52125 363-912 충북 청원군 옥산면  장남리                    52125
52126 363-913 충북 청원군 옥산면  장동리                    52126
52127 363-912 충북 청원군 옥산면  호죽리                    52127
52128 363-913 충북 청원군 옥산면  환희리                    52128
52129 363-910 충북 청원군 옥산면                            52129
52130 363-821 충북 청원군 현도면  노산리                    52130
52131 363-822 충북 청원군 현도면  달계리                    52131
52132 363-822 충북 청원군 현도면  매봉리                    52132
52133 363-823 충북 청원군 현도면  상삼리                    52133
52134 363-821 충북 청원군 현도면  선동리                    52134
52135 363-822 충북 청원군 현도면  시동리                    52135
52136 363-822 충북 청원군 현도면  시목리                    52136
52137 363-821 충북 청원군 현도면  양지리                    52137
52138 363-823 충북 청원군 현도면  우록리                    52138
52139 363-823 충북 청원군 현도면  죽암리                    52139
52140 363-823 충북 청원군 현도면  죽전리                    52140
52141 363-823 충북 청원군 현도면  중삼리                    52141
52142 363-822 충북 청원군 현도면  중척리                    52142
52143 363-821 충북 청원군 현도면  하석리                    52143
52144 363-820 충북 청원군 현도면                            52144

In [156]:
head(zip2013, 10)

   ZIPCODE SIDO GUGUN  DONG    RI            BUNJI       SEQ
1  135-806 서울 강남구 개포1동 경남아파트                 1
2  135-807 서울 강남구 개포1동 우성3차아파트 (1∼6동)      2
3  135-806 서울 강남구 개포1동 우성9차아파트 (901∼902동)  3
4  135-770 서울 강남구 개포1동 주공아파트    (1∼16동)     4
5  135-805 서울 강남구 개포1동 주공아파트    (17∼40동)    5
6  135-966 서울 강남구 개포1동 주공아파트    (41∼85동)    6
7  135-807 서울 강남구 개포1동 주공아파트    (86∼103동)   7
8  135-805 서울 강남구 개포1동 주공아파트    (104∼125동)  8
9  135-807 서울 강남구 개포1동 현대1차아파트 (101∼106동)  9
10 135-805 서울 강남구 개포1동               565         10